Common_Lisp/install-common-lisp-in-fedora.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>install-common-lisp-in-fedora</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="install-common-lisp-in-fedora"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-07-18 03:01:24 PDT"/>
<meta name="author" content="zhuchunlite"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">install-common-lisp-in-fedora</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Fedora 15环境下安装Common Lisp(转载)</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><span class="section-number-3">1</span> Fedora 15环境下安装Common Lisp(转载)</h3>
<div class="outline-text-3" id="text-1">


<p>
   需要用到的软件：
</p>
<ul>
<li><b>sbcl</b> ，比较流行的一种common lisp实现；
</li>
<li><b>emacs</b> ，用作开发环境，虽然比较复杂，但是比原来的命令行好用多了；
</li>
<li><b>slime</b> ，emas下的一个交互式lisp开发环境；
</li>
<li><b>quicklisp</b> ，common lisp包管理系统。
</li>
</ul>


<p>
   先用yum安装emacs和sbcl。
</p>
<p>
   然后按如下步骤安装quicklisp。
</p>
<p>
   下载quicklisp安装脚本：
</p>


<pre class="example">wget http://beta.quicklisp.org/quicklisp.lisp
</pre>


<p>
   启动sbcl：
</p>


<pre class="example">sbcl --load quicklisp.lisp   
</pre>


<p>
   安装quicklisp：
</p>


<pre class="example">(quicklisp-quickstart:install)   
</pre>


<p>
   添加quicklisp到启动文件，以后启动sbcl会自动加载quicklisp
</p>


<pre class="example">(ql:add-to-init-file)   
</pre>


<p>
   将会添加下列代码到~/.sbclrc文件中:
</p>


<pre class="src src-lisp"><span style="color: #ff0000;">;;;</span><span style="color: #ff0000;">I will append the following lines to #P"/home/zhuchunlite/.sbclrc":</span>
<span style="color: #ff0000;">;;; </span><span style="color: #ff0000;">The following lines added by ql:add-to-init-file:</span>
#-quicklisp
(<span style="color: #00ffff; font-weight: bold;">let</span> ((quicklisp-init (merge-pathnames <span style="color: #00ff00;">"quicklisp/setup.lisp"</span>
                   (user-homedir-pathname))))
(<span style="color: #00ffff; font-weight: bold;">when</span> (probe-file quicklisp-init)
  (load quicklisp-init)))
</pre>


<p>
   用quicklisp安装slime
</p>


<pre class="example">(ql:quickload "quicklisp-slime-helper")   
</pre>


<p>
   安装脚本执行完之后会给出一段elisp代码，按照说明把代码加入.emacs文件。
</p>
<p>
   代码示例：
</p>


<pre class="example">(load (expand-file-name "~/quicklisp/slime-helper.el"))
;; Replace "sbcl" with the path to your implementation
(setq inferior-lisp-program "sbcl")
;;改为==&gt;
(setq inferior-lisp-program "/usr/bin/sbcl --noinform")
</pre>


<p>
   启动emacs，M-x slime启动slime，进入交互式cl编程环境，大功告成！如果还嫌麻烦，直接用Lispbox。
</p>
<p>
   Slime模式一些按键：
</p>


<pre class="example">   REPL下的快捷键
   M-n/M-p　　向下/向上查找输入历史
   编辑文件时的快捷键
   C-x C-e　　                 对光标之前的表达式进行求值
   C-x C-r　　                 对一个区域进行求值
   C-c C-c　　                 编译光标所在的整个form　　　　　
   M-x slime-compile-region　　编译一个区域
   C-c C-k　　                 编译并装载(load)当前buffer中的源文件
　 C-c M-k　　                 编译但是不装载当前文件
 　C-c C-l　　                 加载当前文件　　　　　　
 　M-.　　                     查找当前光标下符号的定义
　 C-x 4 .　　                 在另一个buffer中打开光标下符号的定义(注意最后一个是句号键)
   C-c C-d d　　               在一个新的buffer中描述当前光标下的符号
　 C-c C-d h　　               在Common Lisp Hyperspec中查找当前光标下的符号
　 C-c C-d ~　　               在Common Lisp Hyperspec中查找某个特定的format控制字符
　 C-c C-w C-h　　             列出所有与交叉引用相关的快捷键绑定(都是以C-c C-w开头)
</pre>


<p>
   执行Profile
</p>


<pre class="example">   M-x slime-toggle-profile-fdefinition
　 M-x slime-profile-package
　 M-x slime-profile-report
</pre>


<p>
   Source:<a href="http://life-sucks.net/wp/2011/10/25/fedora15下安装common-lisp开发环境/">http://life-sucks.net/wp/2011/10/25/fedora15%E4%B8%8B%E5%AE%89%E8%A3%85common-lisp%E5%BC%80%E5%8F%91%E7%8E%AF%E5%A2%83/</a>
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-07-18 03:01:24 PDT</p>
<p class="author">Author: zhuchunlite</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
